Repository: tclsteixeira/design-patterns-viewer
Catalog: locales/*/*.po
Languages: pt

source: Cannot open database
pt: Não foi possivel abrir a base de dados

source: Failed to fetch data
pt: Falhou o carregamento dados

source: The parameter type '%s' is not supported in 'Select' queries.
pt: O tipo de parâmetro '%s' não é suportado em consultas 'select'.

source: Unknown parameter type '%i'.
pt: O tipo do parâmetro '%i' é desconhecido.

source: Low
pt: Baixa

source: Medium-low
pt: Média-baixa

source: Medium
pt: Média

source: Medium-high
pt: Média-alta

source: High
pt: Alta

source: Sqlite3 version: %s
pt: Versão do Sqlite3: %s

source: Memory error: failed to allocate memory for '%s'!
pt: Erro de memória: falhou ao alocar memória para '%s'!

source: Testing design patterns code data model '%s'
pt: Testando o modelo de dados de código de padrões de design '%s'

source: %i row(s) loaded.
pt: %i linha(s) carregada(s).

source: Code Id: %d
pt: Id código: %d

source: Design pattern Id: %d
pt: Id de padrões de design: %d

source: Language Id: %d
pt: Id linguagem: %d

source: Language: %s
pt: Linguagem: %s

source: Code: %s
pt: Codigo: %s

source: Succeeded: %s
pt: Sucesso: %s

source: Error: %s
pt: Erro: %s

source: Testing design patterns categories data model '%s'
pt: Testando o modelo de dados de categorias de padrões de design '%s'

source: Category Id: %d
pt: Id categoria: %d

source: Category Name: %s
pt: Nome da categoria: %s

source: Category Description: %s
pt: Descrição da categoria: %s

source: Testing design patterns usage cases data model '%s'
pt: Testando o modelo de dados de casos de uso de padrões de design '%s'

source: Usage case Id: %d
pt: Id casos de uso: %d

source: Designation: %s
pt: Designação: %s

source: Description: %s
pt: Descrição: %s

source: Testing design patterns participants data model '%s'
pt: Testando o modelo de dados de participantes de padrões de design '%s'

source: Participant Id: %d
pt: Id do participante: %d

source: Participant name: %s
pt: Nome do participante: %s

source: Testing design patterns data model '%s'
pt: Testando o modelo de dados de padrões de design '%s'

source: Pattern Name: %s
pt: Nome do padrão: %s

source: Freq. usage: %i -
pt: Freq. uso: %i -

source: System
pt: Sistema

source: Dark
pt: Escuro

source: Light
pt: Claro

source: About
pt: Sobre

source: Theme:
pt: Tema:

source: Error
pt: Erro

source: Code example
pt: Exemplo de código

source: Frequency of use:
pt: Frequência de uso:

source: Description
pt: Descrição

source: Participants
pt: Participantes

source: Usage Cases
pt: Casos de uso

source: Patterns
pt: Padrões

source: Database file not found at '%s'!
pt: Ficheiro de base de dados não encontrado em '%s'!

source: Design Patterns Viewer
pt: Visualizador De Padrões De Design

source: database engine
pt: sistema de base de dados

source: Developed with
pt: Desenvolvido com

source: Copyright
pt: Direitos de autor
